In [1]:
import pandas as pd

# Reading Files

In [2]:
df_wind = pd.read_csv('wind_turbine.csv')
df_wind.head()

   YEAR  LATITUDE  LONGITUDE  COUNTRY
0  2014   28.4624    -0.0576  Algeria
1  2026   26.2540    29.2675    Egypt
2    -1   26.5583    31.6773    Egypt
3    -1   29.6607    32.3314    Egypt
4  2025   28.1338    33.2602    Egypt

In [3]:
df_bird = pd.read_csv('common_crane.csv')
df_bird.head()

,OBSERVATION COUNT,COUNTRY,LATITUDE,LONGITUDE,OBSERVATION DATE,TIME OBSERVATIONS STARTED,DURATION MINUTES,YEAR
0,7,United Kingdom,52.744315,1.624603,8/10/1993,NaN,NaN,1993.0
1,2,Finland,59.809343,22.893696,15/04/1984,NaN,NaN,1984.0
2,35,Finland,61.481060,23.823474,20/04/1972,14:20:00,NaN,1972.0
3,20,Sweden,57.278110,14.000840,27/05/1991,NaN,NaN,1991.0
4,20,Sweden,57.295939,13.944397,20/07/1995,10:30:00,450.0,1995.0

# Removing Invalid Years

In [4]:
df_wind = df_wind[df_wind["YEAR"] != -1]

In [7]:
print(-1 in df_wind["YEAR"].values)

False

# Merging the Dataframes

In [8]:
df_merged = df_wind.merge(df_bird, on=["COUNTRY", "YEAR"], how="inner")

In [9]:
df_merged.to_csv('merged_data.csv', index=False)

In [11]:
df_merged.head()

,YEAR,LATITUDE_x,LONGITUDE_x,COUNTRY,OBSERVATION COUNT,LATITUDE_y,LONGITUDE_y,OBSERVATION DATE,TIME OBSERVATIONS STARTED,DURATION MINUTES
0,2023,28.3553,33.0622,Egypt,20,26.845628,33.998315,22/10/2023,0:34:00,90.0
1,2023,28.3553,33.0622,Egypt,1,28.010269,34.408268,23/12/2023,14:31:00,116.0
2,2023,28.3553,33.0622,Egypt,2,27.099550,33.837988,1/4/2023,10:00:00,90.0
3,2023,28.3553,33.0622,Egypt,400,27.393946,33.681893,14/03/2023,10:45:00,90.0
4,2023,28.3553,33.0622,Egypt,1,27.940700,34.301800,24/12/2023,7:20:00,281.0

In [12]:
print(len(df_wind))
print(len(df_bird))
print(len(df_merged))

16302
269456
6523067